// StateData.js

export const sidebarData = {
  recent_posts: [
    {
      id: 401,
      title: "Grow PwD Lucknow Centre: 'सामाजिक प्रगति'",
      category: "शिक्षा",
      imageUrl:
        "https://daynightnews.in/wp-content/uploads/2025/12/Screenshot_2025-12-06-21-00-37-25-150x150.jpg",
    },
    {
      id: 402,
      title: "सुपीरियर ग्रुप ऑफ इंडस्ट्रीज में पोश...",
      category: "उद्योग",
      imageUrl:
        "https://daynightnews.in/wp-content/uploads/2025/12/Screenshot_2025-12-06-20-52-52-79-150x150.jpg",
    },
    {
      id: 403,
      title: "Hyderabad House में शुरू हुई Modi-Putin...",
      category: "अंतर्राष्ट्रीय",
      imageUrl:
        "https://daynightnews.in/wp-content/uploads/2025/12/dd-1-150x150.jpg",
    },
    {
      id: 404,
      title: "हनुमानगढ़ जिले में 15 करोड़ रुपये...",
      category: "इंफ्रास्ट्रक्चर",
      imageUrl:
        "https://daynightnews.in/wp-content/uploads/2025/12/dd-150x150.jpg",
    },
  ],
  hot_categories: [
    { name: "स्टार्टअप फंडिंग", count: 45 },
    { name: "रियल एस्टेट निवेश", count: 22 },
    { name: "ऑटोमोबाइल बिक्री", count: 31 },
    { name: "बैंकिंग सुधार", count: 18 },
  ],
  social_links: [
    {
      name: "Facebook",
      icon: "fab fa-facebook-f",
      followers: "3.5M",
      color: "#3b5998",
      url: "/State",
    },
    {
      name: "Twitter",
      icon: "fab fa-twitter",
      followers: "1.2M",
      color: "#1da1f2",
      url: "/State",
    },
    {
      name: "YouTube",
      icon: "fab fa-youtube",
      followers: "850K",
      color: "#ff0000",
      url: "/State",
    },
    {
      name: "Instagram",
      icon: "fab fa-instagram",
      followers: "2.1M",
      color: "#e4405f",
      url: "/State",
    },
  ],
};

export const stateNewsData = {
  feature: {
    id: 101,
    category: " राज्य",
    title:
      "करूर भगदड़: मद्रास HC के आदेश पर SC के गंभीर सवाल, CBI जांच पर फैसला 13 अक्टूबर को",
    summary:
      "तमिलनाडु के करूर में अभिनेता विजय की राजनीतिक रैली में हुई भगदड़ की केंद्रीय जाँच ब्यूरो (सीबीआई) से जाँच कराने की माँग वाली विजय की तमिलगा वेत्री कझगम (टीवीके) की याचिका पर सुप्रीम कोर्ट 13 अक्टूबर को अपना फैसला सुनाएगा। 29 सितंबर की इस घटना में 41 लोगों की मौत हो गई थी और भीड़ प्रबंधन तथा जाँच पारदर्शिता को लेकर चिंताएँ पैदा हो गई थीं। सुनवाई के दौरान, सुप्रीम कोर्ट ने कहा कि वह भगदड़ की सीबीआई जाँच की माँग वाली याचिका पर आदेश पारित करेगा। अदालत ने तमिलनाडु सरकार से भी इस पर जवाब दाखिल करने को कहा। याचिका में मद्रास उच्च न्यायालय के उस आदेश को चुनौती दी गई है जिसमें जाँच एजेंसी को स्थानांतरित करने से इनकार कर दिया गया था और विशेष जाँच दल (एसआईटी) से जाँच कराने का आदेश दिया गया था, जिस पर टीवीके ने आरोप लगाया था कि यह पक्षपातपूर्ण हो सकता है।न्यायमूर्ति जेके माहेश्वरी और न्यायमूर्ति एनवी अंजारिया की पीठ ने सवाल उठाया कि मद्रास उच्च न्यायालय की चेन्नई पीठ की एकल पीठ ने इस मामले का संज्ञान क्यों लिया और आदेश क्यों पारित किया। हालाँकि करूर, जहाँ भगदड़ हुई थी, उसके अधिकार क्षेत्र में है, लेकिन मामले की सुनवाई उच्च न्यायालय की मदुरै पीठ कर रही थी। टीवीके की ओर से अधिवक्ता गोपाल सुब्रमण्यम ने दावा किया कि उच्च न्यायालय ने पक्षकारों की राय सुने बिना ही अपना फैसला सुना दिया। उच्च न्यायालय में दायर याचिका का उद्देश्य बहुत सीमित था। सुब्रमण्यम ने कहा सरकार को रोड शो के लिए एक प्रोटोकॉल बनाने का निर्देश दिया जाना चाहिए। उच्च न्यायालय के आदेश में कई आरोप लगाए गए हैं। मदुरै पीठ को इस मामले की सुनवाई करनी चाहिए थी क्योंकि वह इस मुद्दे पर दायर याचिकाओं पर पहले ही विचार कर चुकी है। वकील बिना कोई हलफनामा दाखिल किए पेश हुए। यह भगदड़ है। यह एक मानवीय त्रासदी है। यह आरोप कि अभिनेता विजय को पक्ष नहीं बनाया गया, पूरी तरह से झूठा है।",
    imageUrl:
      "https://daynightnews.in/wp-content/uploads/2025/10/aa-29.jpg",
    date: "December 10, 2025",
    author: "Business Desk",
  },
   grid_posts: [
    {
      id: 102,
      category: "टेक्नोलॉजी",
      title:
        "PAN-Aadhaar लिंक करने की अंतिम तिथि करीब, इन आसान स्टेप्स से तुरंत निपटाएं काम",
      summary:
        "क्या आप ने अभी तक पैन कार्ड को आधार कार्ड से लिंक नहीं कराया, तो जल्द ही करा लें। हालिए में आयकर विभाग ने कहा है कि अगर तय सीमा तक पैन कार्ड को आधार कार्ड से लिंक नहीं किया गया, तो उसे इनएक्टिव कर दिया जाएगा। आपको बता दें कि,केंद्रीय प्रत्यक्ष कर बोर्ड ( CBDT) ने अप्रैल 2025 में जारी नोटिफिकेशन में कहा है कि, अगर आप इसे लिंक नहीं करते हैं तो आपका पैन कार्ड इनएक्टिव हो जाएगा।  आप जल्द से जल्द ही पैन को आधार कार्ड से लिंक कर लें। आपको ऐसा करने के लिए 31 दिसंबर तक का समय है, इसलिए जितनी जल्दी हो सके अपने पैन कार्ड को अपने आधार कार्ड से लिंक कर लें।बता दें कि, पैन कार्ड बैंक अकाउंट ओपन करवाने से लेकर इनकम टैक्स रिटर्न फाइल, लोन लेने, शेयर मार्केट में इन्वेस्ट करने और बड़े फाइनेंशियल ट्राजैक्शन करने जैसी कई फाइनेंशियल एक्टिविटीज के लिए बेहद जरुरी होता है। आइए आपको बताते हैं कि पैन कार्ड इनएक्टिव होने से क्या होता हैPAN इनएक्टिव होने पर क्या हो सकता हैयदि आपका पैन कार्ड डीएक्टिवेट हो गया तो आपके कई सर्विस इस्तेमाल करने में दिक्कत हो सकती है, जैसे कि बैंक या डीमैट अकाउंट खोलना। इतना ही नहीं, आप स्टॉक मार्केट और म्यूचुअल फंड में इन्वेस्ट करना मुश्किल हो जाएगा और आप 50,000 हजार रुपये से ज्यादा कैश डिपॉजिट या फिक्स्ड डिपॉजिट नहीं कर पाएंगे। लोन, क्रेडिट कार्ड या प्रॉपर्टी खरीदने में भी मुश्किल हो सकती हैं।  वहीं, आप सरकारी स्कीम और सब्सिडी का फायदा नहीं उठा पाएंगे। यह कह लीजिए कि आपके सारे फाइनेंशियल लाइफ फ्रीज हो जाएगीPAN को Aadhaar से ऑनलाइन कैसे लिंक करें?– सबसे पहले आप  इनकम टैक्स ई-फाइलिंग वेबसाइट incometax.gov.in पर जाएं।– अब होमपेज पर Link Aadhaar ऑप्शन को चूज करें।– इसके बाद अपना PAN और Aadhaar नंबर एंटर करें।–  अब आपको  Validate पर क्लिक करें।– अगर लिंक नहीं,तो रजिस्टर्ड मोबाइल नंबर एंटर करें।– इसके बाद OTP डालकर सबमिट बटन पर क्लिक कर दें।– लिंकिंग सफल होने पर स्क्रीन पर कन्फर्मेशन मैसेज आएगा।",
      imageUrl: "https://daynightnews.in/wp-content/uploads/2025/11/rrrr-7.png",
      time: "November 6, 2025",
    },
    {
      id: 103,
      category: "टेक्नोलॉजी",
      title:
        "WhatsApp का बड़ा अपडेट: स्टेटस पर इमोजी रिएक्शन से एंगेजमेंट होगा सुपरफास्ट!",
      summary:
        "दुनियाभर में  WhatsApp सबसे लोकप्रिय है। यह एक मैसेजिंग एप है, जो आज के समय में जरुरी हिस्सा बन गया है। WhatsApp अपने यूजर्स के लिए लगातार नए फीचर्स लॉन्च करता रहता है। अब कंपनी जल्द ही रिएक्शन स्टीकर नाम का दिलचस्प अपडेट लेकर आ रहा है। अभी इस फीचर्स पर टेस्टिंग चल रही है। इस फीचर्स के आने से यूजर्स स्टेटस अपडेट पर इमोजी के जरिए तुरंत अपनी प्रतिक्रिया दें सकते हैं। इस प्रकार का फीचर इंस्टाग्राम पर पहले से ही है। इसके आने से इंटरैक्शन को और पर्सनल, फास्ट और मजेदार बनाएगाWhatsApp का बड़ा अपडेट: स्टेटस पर इमोजी रिएक्शन से एंगेजमेंट होगा सुपरफास्ट!यूजर्स खुद ही चुन सकेंगे इमोजीइस फीचर के आने के बाद WhatsApp यूजर्स को इमोजी चुनने की पूरी आजादी है। स्टेटस को पोस्ट करने से पहले ही अपनी भावनाओं के मुताबिक कोई भी इमोजी को चूज कर सकते हैं। फिर आपका स्टेटस अपडेट और ज्यादा एक्सप्रेसिव और यूनिक दिखेंगे।व्यूअर्स देंगे पाएंगे रिएक्शनबता दें कि, जो कोई भी यूजर स्टेटस देखेगा, उसे उस पर लगा रिएक्शन स्टिकर दिखेगा। इस इमोजी पर टैप करते ही रिएक्शन चला जाएगा। आपका यह रिएक्शन पूरी तरह प्राइवेट रहेगा और केवल स्टेटस पोस्ट करने वाला व्यक्ति ही देख पाएगा कि किसने रिएक्ट किया है। वहीं, WhatsApp की एंड-टू-एंड एन्क्रिप्शन से डेटा सेफ रहेगा।नोटिफिकेशन के जरिए मिलेगा अपडेटकिसी भी यूजर ने आपके स्टेटस पर रिएक्शन दिया है, तो WhatsApp तुरंत नोटिफिकेशन भेजेगा। यह भी दिखेगा कि किसने कौन-सा इमोजी यूज किया है। इसके साथ ही एप के एक्टिविटी शीट में भी सभी रिएक्शन एक जगह देखने का विकल्प होगा। ऐसे में एंगेजमेंट को ट्रैक कर सकते हैं। बता दें कि, इस समय आप WhatsApp में केवल 8 प्रीसेट इमोजी से स्टेटस पर रिएक्ट करने की सुविधा है। इस नए फीचर से केवल एंगेजमेंट बढ़ेगा, बल्कि प्लेटफॉर्म पर कनेक्टिविटी भी और मजबूत होगी।",
      imageUrl: "https://daynightnews.in/wp-content/uploads/2025/10/dddd-8.png",
      time: "November 6, 2025",
    },
    {
      id: 104,
      category: "टेक्नोलॉजी",
      title:
        "Arattai का ये फीचर WhatsApp की बढ़ाने वाला है टेंशन, कंपनी ने कर दिया कन्फर्म",
      summary:
        "Arattai ऐप में अब एक ऐसा फीचर आ रहा है जो वॉट्सऐप की टेंशन बढ़ा सकता है। भारत में बन इस ऐप में अभी तक वॉइस और वीडियो कॉल ही एंड टू एंड एनक्रिप्टेड है। अब इसमें चैटिंग को भी एंड टू एंड एनक्रिप्ट बनाया जा रहा है। ये फीचर आने के बाद इस प्लेटफॉर्म पर भेजे जाने वाले मैसेज यूजर्स के बीच ही रहेंगे औऱ कंपनी समेत कोई भी थर्ड पार्टी इन्हें पढ़ नहीं पाएगी।जोहो कॉर्पोरेशन की Arattai ऐप में अब एक ऐसा फीचर आ रहा है जो वॉट्सऐप की टेंशन बढ़ा सकता है। भारत में बन इस ऐप में अभी तक वॉइस और वीडियो कॉल ही एंड टू एंड एनक्रिप्टेड है। अब इसमें चैटिंग को भी एंड टू एंड एनक्रिप्ट बनाया जा रहा है। ये फीचर आने के बाद इस प्लेटफॉर्म पर भेजे जाने वाले मैसेज यूजर्स के बीच ही रहेंगे औऱ कंपनी समेत कोई भी थर्ड पार्टी इन्हें पढ़ नहीं पाएगी। हालांकि, वॉट्सऐप पर काफी समय से ये फीचर मिल रहा है। पिछले कुछ दिनों से Arattai की पॉपुलैरिटी कई गुना बढ़ी है और अब कंपनी इसके प्राइवेसी फीचर्स को मजबूत बनाने पर काम कर रही है। मनीकंट्रोल के साथ बात करते हुए ऐप के सीईओ मणि वेंबू ने कहा कि, हम इस पर काम कर रहे हैं। पर्सनल मैसेजिंग में हम सीक्रेट चैट का ऑप्शन दे रहे हैं, जो यूजर्स को प्राइवेट बातचीत के लिए एनक्रिप्शन इनबल करने का ऑप्शन देता है। ये अभी तक डिफॉल्ट नहीं है। अब पूरी टीम इसे सभी यूजर्स के लिए अवेलेबल करवाने प लगी हुई है। वेंबू के इस बयान से पहले सोशल मीडिया पर कई यूजर्स ने Arattai के सिक्योरिटी आर्किटेक्टर पर सवाल उठाए थे। जोहो ने एक साइड प्रोजेक्ट के तौर पर Arattai ऐप को 2021 में लॉन्च किया था, लेकिन ये लोगों के बीच पॉपुलर नहीं हो सकी। अब पिछले दिनों केंद्रीय मंत्री धर्मेंद्र प्रधान, निर्मला सीतारमण और पीयूष गोयल जैसे दिग्गज नेताओं ने इसे सपोर्ट करने की अपील की थी। इसके बाद इसे डाउनलोड करने वालों की संख्या तेजी से बढ़ी और ऐप स्टोर पर सबसे ज्यादा डाउनलोड होने वाली ऐप्स की सूची में टॉप पर पहुंच गई।",
      imageUrl:
        "https://daynightnews.in/wp-content/uploads/2025/10/1000167479.jpg",
      time: "November 6, 2025",
    },
    {
      id: 105,
      category: "टेक्नोलॉजी",
      title:
        "मेटा का AI में बड़ा दांव: जुकरबर्ग ने 14.3 अरब डॉलर लगाए, 28 वर्षीय वांग बने सुपरइंटेलिजेंस हेड",
      summary:
        "मार्क जुकरबर्ग ने मेटा के AI प्रयासों को नई दिशा देने के लिए स्केल एआई के सह-संस्थापक एलेक्ज़ेंडर वांग को सुपरइंटेलिजेंस लैब्स का नेतृत्व सौंपा है। यह रणनीतिक कदम मेटा को AI के शोध, उत्पाद और बुनियादी ढांचे में मजबूती देगा, जिससे तकनीकी भविष्य में उसकी स्थिति और सुदृढ़ होगी।कृत्रिम बुद्धिमत्ता (AI) की दुनिया में एलेक्ज़ेंडर वांग का नाम तेजी से उभर रहा है। 28 साल की उम्र में वांग को मार्क जुकरबर्ग ने मेटा की सुपरइंटेलिजेंस लैब्स का नेतृत्व सौंपा है। इसके साथ ही उनकी स्टार्टअप कंपनी में मेटा ने 14.3 अरब डॉलर का निवेश किया है।एलेक्ज़ेंडर वांग और उनकी साथी लूसी गुओ ने 2016 में स्केल एआई नाम से स्टार्टअप शुरू किया था। इस कंपनी का काम बड़े पैमाने पर डेटा को व्यवस्थित करना और लेबल करना है, ताकि मशीन लर्निंग मॉडल्स को प्रशिक्षित किया जा सके। आज स्केल एआई दुनिया की प्रमुख एआई डेटा कंपनियों में शामिल है।मेटा में शामिल होने के बाद वांग ने सुपरइंटेलिजेंस प्रोग्राम को नई दिशा देने के लिए एआई टीम को चार हिस्सों में विभाजित किया, जिससे रिसर्च, प्रोडक्ट और इन्फ्रास्ट्रक्चर पर बेहतर फोकस किया जा सके। वांग तकनीकी क्षेत्र के साथ-साथ नीति निर्माण और अंतरराष्ट्रीय सहयोग में भी सक्रिय हैं और उन्होंने अमेरिका के सांसदों और एआई उद्योग के नेताओं से मजबूत संबंध बनाए हैं।इस नियुक्ति से यह साफ होता है कि मेटा अब केवल सोशल मीडिया कंपनी नहीं रहना चाहती, बल्कि भविष्य में एआई के क्षेत्र में अग्रणी बनने की योजना पर काम कर रही है।",
      imageUrl:
        "https://daynightnews.in/wp-content/uploads/2025/10/1000167475.jpg",
      time: "November 6, 2025",
    },
    {
      id: 106,
      category: "टेक्नोलॉजी",
      title:
        "AI के जादू का करें इस्तेमाल और अपनी तस्वीरों को दें 80s की बॉलीवुड एक्ट्रेस जैसा रेट्रो लुक, जानें कैसे",
      summary:
        "‘गूगल जेमिनी का नैनो बनाना’ एआई टूल, महिलाओं के बीच एक नया पसंदीदा टाइमपास बन गया है, और जो भी महिलाएं करती हैं, वो ट्रेंड बन जाता है। घिबली से क्यूट तस्वीरें बनाने के बाद, अब महिलाएं अपनी तस्वीरों को 80 के दशक की बॉलीवुड अभिनेत्रियों के रेट्रो लुक में बदल रही हैं।इस ट्रेंड में रेट्रो साड़ी, बालों में फूल और दीवार के पास आइकॉनिक पोज, ये सब कुछ है। यह ट्रेंड महिलाओं को बहुत पसंद आ रहा है और कई महिलाएं पहले ही इसे ट्राई कर चुकी हैं। अगर आपने अभी तक ऐसा नहीं किया है, तो मैं आपको बताती हूं कि यह कैसे करना है।अपनी खुद की एआई-जनरेटेड विंटेज साड़ी इमेज कैसे बनाए1. गूगल जेमिनी खोलें: सबसे पहले, अपने फोन पर जेमिनी ऐप डाउनलोड करें या इसे अपने डेस्कटॉप पर खोलें। इसके बाद, अपने गूगल अकाउंट से लॉग इन करें।2. इमेज एडिटिंग मोड में जाएं: जेमिनी पर, नीचे की तरफ आपको केले का आइकन दिखेगा। उस पर क्लिक करें और ‘इमेज एडिटिंग आजमाएं’ चुनें।3. अपनी फोटो अपलोड करें: एक साफ और अच्छी सोलो पोर्ट्रेट फोटो चुनें जिसमें आपका चेहरा साफ दिखाई दे। ग्रुप फोटो या ब्लरी सेल्फी लेने से बचें।4. प्रॉम्प्ट डालें: अब आपको एक प्रॉम्प्ट डालना होगा। आप किसी वायरल साड़ी प्रॉम्प्ट को कॉपी-पेस्ट कर सकते हैं या अपना खुद का प्रॉम्प्ट बना सकते हैं। प्रॉम्प्ट में आप साड़ी का रंग, लाइटिंग स्टाइल और अन्य डिटेल्स बता सकते हैं।5. इमेज जनरेट करें और सेव करें: जनरेट पर क्लिक करें और कुछ सेकंड इंतजार करें। AI आपकी रेट्रो साड़ी पोर्ट्रेट बना देगा। इसके बाद, आप इसे इंस्टाग्राम रील्स या स्टोरीज पर शेयर कर सकते हैं।एआई-जनरेटेड विंटेज साड़ी इमेज बनाने के लिए ये प्रॉम्प्ट इस्तेमाल करें1. ‘रेड साड़ी’ प्रॉम्प्ट‘इस व्यक्ति को 90 के दशक की बॉलीवुड हीरोइन की तरह एक बहती हुई लाल शिफॉन साड़ी में बदलें। उसके बाल नरम लहरों में हों। बैकग्राउंड रोमांटिक और नाटकीय लगे, जिसमें गर्म टोन और सूरज डूबने की सुनहरी रोशनी हो।’2. ‘सफेद पोल्का डॉट साड़ी’ प्रॉम्प्ट‘एक महिला का रियलिस्टिक पोर्ट्रेट बनाएं, जो एक शीर सफेद पोल्का डॉट साड़ी में हो। उसके कान के पीछे एक छोटा गुलाबी फूल लगा हो। साइड से आती गर्म रोशनी, सिनेमैटिक शैडो बनाए।’3. ‘पर्पल साड़ी’ प्रॉम्प्ट‘इस फोटो को रेट्रो, ग्रैनी और ब्राइट इमेज में बदलें। सब्जेक्ट ने एक पर्पल शिफॉन साड़ी पहनी हो। बैकग्राउंड में एक पुराना लकड़ी का दरवाजा हो। हवा में बाल उड़ रहे हों, और गहरे शैडो के साथ सीन में मिस्ट्री दिखे।’4. ‘पीली साड़ी’ प्रॉम्प्ट‘इस फोटो को एक रोमांटिक 90 के दशक के बॉलीवुड पोस्टर की तरह बदलें, जिसमें सब्जेक्ट बहती हुई पीली शिफॉन साड़ी में हो। बैकग्राउंड में पहाड़ और नीला आसमान हो। इमेज थोड़ी ग्रैनी हो, लेकिन रंगीन। लाइटिंग ऐसी हो, जैसे सुनहरी धूप पड़ रही हो।’",
      imageUrl: "https://daynightnews.in/wp-content/uploads/2025/09/kkk-5.png",
      time: "November 6, 2025",
    },
    {
      id: 107,
      category: "टेक्नोलॉजी",
      title: "भारतीय साइबर एजेंसी की चेतावनी, Chrome को कर ले अपडेट, आपका डेटा खतरे में है",
      summary:
        "भारत की साइबर सिक्योरिटी एजेंसी CERT-In ने गूगल क्रोम यूजर्स को लेकर हाई-सीवेरिटी सिक्योरिटी अलर्ट जारी किया है। एजेंसी ने चेतावनी दी है कि डेस्कटॉप प्लेटफॉर्म पर चलने वाले क्रोम ब्राउजर के कई वर्जन में गंभीर खामियां पाई गई हैं, जिनका फायदा उठाकर रिमोट अटैक किए जा सकते हैं। इन वल्नरेबिलिटीज के जरिए हैकर्स न सिर्फ सिस्टम का कंट्रोल हासिल कर सकते हैं, बल्कि डेटा चोरी और सर्विस डिसरप्शन जैसी बड़ी दिक्कतें भी पैदा कर सकते हैं। CERT-In ने गूगल क्रोम यूजर्स को लेकर हाई-सीवेरिटी सिक्योरिटी अलर्ट जारी किया है। एजेंसी ने चेतावनी दी है कि डेस्कटॉप प्लेटफॉर्म पर चलने वाले क्रोम ब्राउजर के कई वर्जन में गंभीर खामियां पाई गई हैं, जिनका फायदा उठाकर रिमोट अटैक किए जा सकते हैं।CERT-In एडवाइजरी के मुताबिक, विंडो और macOS पर 140.0.7339.80/81 से पहले के वर्जन और Linux पर 140.0.7339.80 से पुराने वर्जन इस समस्या से प्रभावित हैं। इन खामियों के जरिए अटैकर्स सिस्टम पर आर्बिट्ररी कोड चला सकते हैं और सिक्योरिटी रिस्ट्रिक्शंस को बायपास कर सकते हैं। सिक्योरिटी एक्सपर्ट्स का कहना है कि इन वल्नरेबिलिटीज की जड़ क्रोम के V8 JavaScript इंजन में है। इन खामियों के जरिए अटैकर्स सिस्टम पर आर्बिट्ररी कोड चला सकते हैं और सिक्योरिटी रिस्ट्रिक्शंस को बायपास कर सकते हैं। सिक्योरिटी एक्सपर्ट्स का कहना है कि इन वल्नरेबिलिटीज की जड़ क्रोम के V8 जावा स्क्रीप्ट इंजन में है। इसमें Use Afer Free बग और टूलबार, एक्सटेंशन और डाउनलोड से जुड़ी गलत इंप्लीमेंटेशन सामने आई है। इन बग्स के कारण किसी भी यूजर को स्पेशली डिजाइन किए गए वेबपेज पर ले जाकर उसका सिस्टम हैक किया जा सकता है। CERT-In की एडवाइजरी में साफ कहा गया है कि ये वल्नरेबिलिटीज V8 इंजन में यूज-आफ्टर फ्री और टूलबार, एक्सटेंशन व डाउनलोड्स में इनएप्रोप्रिएट इंप्लीमेंटेशन के कारण मौजूद हैं। एक रिमोट अटैकर किसी यूजर को स्पेशली क्राफ्टेड वेबपेज पर विजिट कराने के लिए मैनिपुलेट कर सकता है, जिससे सिस्टम पूरी तरह से कम्प्रोमाइज हो सकता है। वहीं CET-In ने सभी क्रोम यूजर्स से अपील की है कि वे तुरंत ब्राउजर का लेटेस्ट अपडेट इंस्टॉल करें। गूगल की ओर से इसका फिक्स पहले ही स्टेबल चैनल पर जारी किया जा चुका है। क्रोम रिलीज ब्लॉग पर अपडेट से जुड़ी और जानकारी उपलब्ध है। ",
      imageUrl:
        "https://daynightnews.in/wp-content/uploads/2025/09/ddd-10.png",
      time: "November 6, 2025",
    },
    {
      id: 108,
      category: "टेक्नोलॉजी",
      title:
        "घर बैठे ही पता लगाएं आधार कार्ड फर्जी है या नहीं, इन आसान टिप्स को फॉलो करें",
      summary:
        "अब हर जगह पर आधार कार्ड को पहचान के रुप में इस्तेमाल किया जाता है। ज्यादातर लोग तो आधार कार्ड की पहचान नहीं करते है कि यह फर्जी है या नहीं। कई बार होता है कि जब हम घर में किरायेदान या दुकान में नौकरी के लिए किसी को रखते हैं, तो तुरंत वेरिफिकेशन नहीं करपाते है, तो ऐसे में आप घर पर ही वेरीफाई कर सकते हैं। आधार को घर पर ही वेरिफाई करना बेहद आसान है। बता दें कि, आधार कार्ड में 12 अंक होते हैं, जिसकी मदद से आप आसानी पता कर सकते हैं आधार फर्जी है या नहीं।आधार कार्ड को भारतीय पहचान पत्र के रुप में इस्तेमाल करा जाता है। अब फर्जी आधार कार्ड की पहचान करना बेहद आसान हो चुका है। इसके लिए आप UIDAI की वेबसाइट और mAdhaar एप के जरिए आप फ्री में आधार कार्ड वेरिफाई कर सकते हैं। वैसे भी आजकल काफी फ्रॉड हो रहे हैं, इससे बचने के लिए आप वेबसाइट पर जाएं आधार नंबर और कैप्चा कोड डालकर वेरिफिकेशन कर सकते हैं।आधार वेरिफिकेशन कैसे करें?सबसे पहले आप आधार कार्ड वेरिफिकेशन के लिए ऑफिशियल वेबसाइट uidai.gov.in पर जाएं।इसके बाद My Aadhaar ऑप्शन में क्लिक करके आधार सर्विसेज के अंदर वेरिफाई आधार नंबर पर क्लिक करना है।अब आपको आधार नंबर और कैप्चा कोड डालकर वेरीफाई का बटन पर क्लिक करना है। आपको अगले पेज पर आधार नंबर के एक्टिव या डिएक्टिव होने की जानकारी मिल जाएगी। इसके अलावा आपको यहां पर ऑपरेशन स्टेटस दिखाई देगा। जिससे आपको पता चल जाएगा कि आधार फर्जी है या नहीं।mAdhaar ऐप पर कैसे आधार वेरिफाई करेंजैसा कि आधार कार्ड में क्यूआर कोड होता है। जिसकी मदद से आप आधार को वेरिफिकेशन कर सकते हैं। आप mAdhaar ऐप को भी इंस्टॉल कर सकते हैं। ऐप में आधार वेरिफिकेशन के लिए दो ऑप्शन देखने को मिलेंगे। पहला ऑप्शन आधार वेरीफाई, जिसमें आपको वेबसाइट की तरह आधार संख्या डालकर आधार का वेरिफिकेशन कर सकते हैं।दूसरे ऑप्शन में आपको आधार कार्ड पर दिए गए QR कोड को स्कैन करना है। इस क्यूआर कोड को स्कैन करने से पता चल जाता है कि आधार फर्जी है या नहीं।Facebook",
      imageUrl: "https://daynightnews.in/wp-content/uploads/2025/09/ddd-9.png",
      time: "November 6, 2025",
    },{
      id: 109,
      category: "टेक्नोलॉजी",
      title:
        "iPhone यूजर्स के लिए जल्द बदल जाएगा WhatsApp, देखें पहली झलक",
      summary:
        "WhatsApp के नए Beta अपडेट में ये पता चलना है कि कंपनी iOS 26 के लिए ऐपल का नया Liquid Glass डिजाइन लेकर आ सकती है। यानी WhatsApp में भी आपको लिक्विड ग्लास डिजाइन देखने को मिल सकता है जो ऐप के लुक को पूरी तरह से बदल कर रख देगा।चैटिंग ऐप के रूप में WhatsApp का इस्तेमाल आज भारत और दुनियाभर के लोग कर रहे हैं। कंपनी भी लगातार अपने यूजर्स के लिए नए-नए फीचर्स और अपडेट्स लेकर आती रहती है। वहीं, अब कंपनी iOS यूजर्स यानी आईफोन वालों के लिए एक बड़ा विजुअल चेंज करने की तैयारी में दिख रही है। WhatsApp के नए Beta अपडेट में ये पता चलना है कि कंपनी iOS 26 के लिए ऐपल का नया Liquid Glass डिजाइन लेकर आ सकती है। यानी WhatsApp में भी आपको लिक्विड ग्लास डिजाइन देखने को मिल सकता है जो ऐप के लुक को पूरी तरह से बदल कर रख देगा।जो लोग नहीं जानते उन्हें बता दें कि, ऐपल जल्द ही iOS 26 का स्टेबल अपडेट जारी करने वाला है। जिसमें आपको लिक्विड ग्लास इंटरफेस देखने को मिलेगा। खास बात ये है कि इसमें ग्लास जैसी ट्रांसपेरेंसी और फ्लूइड विजुअल इफेक्ट्स देखने को मिलते हैं। इतना ही नहीं बैकग्राउंड लेयर्स, बटन और कॉन्टेक्स्ट मेन्यू में हल्की डेप्थ, रिफ्लेक्शन और मूवमेंट के हिसाब से चेंज दिखाई देता है। यानी इस अपडेट के साथ न सिर्फ आपका UI बल्कि WhatsApp भी बदल जाएगा। इसके जरिए कंपनी ऐप्स को ज्यादा इंटरएक्टिव और मॉर्डन बना देगी। WABetaInfo की हालिया रिपोर्ट से पता चलता है कि WhatsApp ने iOS 26 SDK के साथ नया ऐप कंपाइल करना स्टार्ट कर दिया है। इसके लिए सबसे पहले नेविगेशन बार और बॉटम टैब्स को लिक्विड ग्लास लुक में बदला गया है। हालांकि, इसके बाद कंपनी धीरे-धीरे बटन, मेन्यू और बाकी इंटरफेस के एलिमेंट्स को भी बदल सकती है। ",
      imageUrl: "https://daynightnews.in/wp-content/uploads/2025/09/dd-9.png",
      time: "November 6, 2025",
    },{
      id: 110,
      category: "टेक्नोलॉजी",
      title:
        "गूगल मैप के सहारे रास्‍ता सफर करना अब खतरनाक होता जा रहा है।",
      summary:
        "उत्‍तर प्रदेश में कई ऐसे मामले सामने आ चुके हैं जिनमें कार सवार गूगल मैप के बताए रास्‍ते पर गए और उनको मौत का सामना करना पड़ा। ताजा केस गोरखपुर से सामने आया है। यहां देर रात एक युवक पार्टी करने के बाद अपने गांव वापस निकला। गांव की जगह वह रेलवे ट्रैक पर पहुंच गया। तभी सामने से तेज रफ्तार में मालगाड़ी आते देख कार सवार के होश उड़ गए। उसकी किस्‍मत अच्‍छी थी कि ट्रेन के ड्राइवर ने समय रहते इमरजेंसी ब्रेक लगा दी वर्ना कुछ भी हो सकता था। बिहार के गोपालगंज में रहने वाले आदर्श राय अपने दोस्‍तों के साथ यूपी के गोरखपुर पार्टी करने आए थे। देर रात एक बजे पार्टी करने के बाद सभी कार से वापस लौटने लगे। आदर्श ने गूगल मैप पर अपने गांव गोपालपुर का नाम डाला तो उसने बिहार के गोपालपुर की जगह गोरखपुर के गोपालपुर की लोकेशन दिखा दी। यह लोकेशन डोमिनगढ़ रेलवे स्‍टेशन और जगतबेला स्‍टेशन के बीच है। आदर्श और उसके दोस्‍तों ने यह ध्‍यान नहीं दिया कि वे बिहार के बजाय यूपी के गोपालपुर जा रहे हैं। आदर्श अपने दोस्‍तों के साथ गूगल मैप के बताए रास्‍ते पर बढ़ता रहा। गूगल मैप के लोकेशन ने उसे एक पगडंडी से होते हुए रेलवे ट्रैक तक पहुंचा दिया। आदर्श रेलवे ट्रैक पार करने की कोशिश करने लगा। इस दौरान कार का पहिया पत्‍थरों में फंस गया। इसी समय सामने से तेज रफ्तार मालगाड़ी आती दिखाई थी। कार में बैठे आदर्श और दोस्‍तों की हालत खराब हो गई। लोको पायलट को जैसे ही ट्रैक पर कार खड़ी दिखाई थी, उसने इमरजेंसी ब्रेक लगाकर मालगाड़ी रोक दी।",
      imageUrl: "https://daynightnews.in/wp-content/uploads/2025/04/jj-3.jpg",
      time: "November 6, 2025",
    }
  ],
};

export const MOCK_STATES = [
  { code: "ALL", name: "All States (सभी राज्य)" },
  { code: "MH", name: "Maharashtra (महाराष्ट्र)" },
  { code: "UP", name: "Uttar Pradesh (उत्तर प्रदेश)" },
  { code: "DL", name: "Delhi (दिल्ली)" },
  { code: "RJ", name: "Rajasthan (राजस्थान)" },
  { code: "KA", name: "Karnataka (कर्नाटक)" },
  { code: "TN", name: "Tamil Nadu (तमिलनाडु)" },
];
